{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true,"batch_input_shape":[null,51],"dtype":"float32"}},{"class_name":"Dense","config":{"units":200,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},{"class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true}},{"class_name":"Dense","config":{"units":100,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true}},{"class_name":"Dense","config":{"units":50,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}},{"class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization4","trainable":true}},{"class_name":"Dense","config":{"units":20,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true}},{"class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout4","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization5","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true}}],"keras_version":"tfjs-layers 0.7.5","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./Aya.weights.bin"],"weights":[{"name":"batch_normalization_BatchNormalization1/gamma","shape":[51],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[51],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[51,200],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[200],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[200],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[200],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[200,100],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[100],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[100],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[100],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[100,50],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[50],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/gamma","shape":[50],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/beta","shape":[50],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[50,20],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[20],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/gamma","shape":[20],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/beta","shape":[20],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[20,1],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[51],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[51],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[200],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[200],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[100],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[100],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_mean","shape":[50],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_variance","shape":[50],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_mean","shape":[20],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_variance","shape":[20],"dtype":"float32"}]}]}